swagger/src/Catalogs/Пути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Пути</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>summary</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ref</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>get</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Операции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>post</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Операции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>put</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Операции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delete</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Операции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>options</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Операции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>patch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Операции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>head</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Операции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>trace</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Операции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>tags</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>tag</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>servers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>server</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>parameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>parameter</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Параметры</v8:Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/Catalogs/Пути/Ext/ObjectModule.bsl
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ЭтотОбъект._description) Тогда
		Описание.Вставить("description", ЭтотОбъект._description);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.summary) Тогда
		Описание.Вставить("summary", ЭтотОбъект.summary);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект._ref) Тогда
		Описание.Вставить("$ref", ЭтотОбъект._ref);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.get) Тогда
		Описание.Вставить("get", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.get));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.post) Тогда
		Описание.Вставить("post", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.post));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.put) Тогда
		Описание.Вставить("put", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.put));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.delete) Тогда
		Описание.Вставить("delete", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.delete));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.options) Тогда
		Описание.Вставить("options", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.options));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.patch) Тогда
		Описание.Вставить("patch", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.patch));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.head) Тогда
		Описание.Вставить("head", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.head));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.trace) Тогда
		Описание.Вставить("trace", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.trace));
	КонецЕсли;
	
	Если ЭтотОбъект.parameters.Количество() > 0 Тогда
		Описание.Вставить("parameters", ОбщегоНазначенияSwagger.СформироватьМассивИзТЧ(ЭтотОбъект, "parameters", "parameter"));
	КонецЕсли;
	
	Если ЭтотОбъект.servers.Количество() > 0 Тогда
		Описание.Вставить("servers", ОбщегоНазначенияSwagger.СформироватьМассивИзТЧ(ЭтотОбъект, "servers", "server"));
	КонецЕсли;
	
	Если ЭтотОбъект.tags.Количество() > 0 Тогда
		Массив = Новый Массив;
		Для каждого ТекСтрока Из ЭтотОбъект.tags Цикл
			Массив.Добавить(Строка(ТекСтрока.tag));
		КонецЦикла;
		Описание.Вставить("tags", Массив);
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
